## Data Loading

Our data set is made out of 7 .csv files. To explore them, we will create 7 data frames and use exploratory statistical data analysis to get in touch with the data.

In [2]:
import pandas as pd
import numpy as np
import matplotlib as mpl
import matplotlib. pyplot as plt
import seaborn as sns

mpl.style.use('ggplot')
print('Matplotlib version: ', mpl.__version__)

Matplotlib version:  3.10.5

In [3]:
df_1 = pd.read_csv(r"C:\Projekt_Ordner\Business_Analysis\Data\1_maven_fuzzy_factory_data_dictionary.csv")
df_2 = pd.read_csv(r"C:\Projekt_Ordner\Business_Analysis\Data\2_order_item_refunds.csv")
df_3 = pd.read_csv(r"C:\Projekt_Ordner\Business_Analysis\Data\3_order_items.csv")
df_4 = pd.read_csv(r"C:\Projekt_Ordner\Business_Analysis\Data\4_orders.csv")
df_5 = pd.read_csv(r"C:\Projekt_Ordner\Business_Analysis\Data\5_products.csv")
df_6 = pd.read_csv(r"C:\Projekt_Ordner\Business_Analysis\Data\6_website_pageviews.csv")
df_7 = pd.read_csv(r"C:\Projekt_Ordner\Business_Analysis\Data\7_website_sessions.csv")

To get a first impressive of the data set I use the .shape .head() .describe() and .info() methods

In [4]:
print(df_1.shape)
print(df_2.shape)
print(df_3.shape)
print(df_4.shape)
print(df_5.shape)
print(df_6.shape)
print(df_7.shape)

(36, 3)
(1731, 5)
(40025, 7)
(32313, 8)
(4, 3)
(1188124, 4)
(472871, 9)

In [8]:
# print(df_1.head())
print(df_2.head())
# print(df_3.head())
# print(df_4.head())
# print(df_5.head())
# print(df_6.head())
# print(df_7.head())

   order_item_refund_id           created_at  order_item_id  order_id  \
0                     1  2012-04-06 11:32:43             57        57
1                     2  2012-04-13 01:09:43             74        74
2                     3  2012-04-15 07:03:48             71        71
3                     4  2012-04-17 20:00:37            118       118
4                     5  2012-04-22 20:53:49            116       116

   refund_amount_usd
0              49.99
1              49.99
2              49.99
3              49.99
4              49.99

In [9]:
# df_1.describe(include = "all")
df_2.describe(include = "all")
# df_3.describe(include = "all")
# df_4.describe(include = "all")
# df_5.describe(include = "all")
# df_6.describe(include = "all")
# df_7.describe(include = "all")

,order_item_refund_id,created_at,order_item_id,order_id,refund_amount_usd
count,1731.000000,1731,1731.000000,1731.000000,1731.000000
unique,NaN,1731,NaN,NaN,NaN
top,NaN,2012-04-06 11:32:43,NaN,NaN,NaN
freq,NaN,1,NaN,NaN,NaN
mean,866.000000,NaN,18472.214905,15868.242057,49.300225
std,499.840975,NaN,11438.074606,9096.061945,4.956015
min,1.000000,NaN,57.000000,57.000000,29.990000
25%,433.500000,NaN,7417.000000,7412.000000,49.990000
50%,866.000000,NaN,19858.000000,17375.000000,49.990000
75%,1298.500000,NaN,26900.000000,22539.500000,49.990000
max,1731.000000,NaN,39950.000000,32255.000000,59.990000

In [10]:
# df_1.info()
df_2.info()
# df_3.info()
# df_4.info()
# df_5.info()
# df_6.info()
# df_7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1731 entries, 0 to 1730
Data columns (total 5 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   order_item_refund_id  1731 non-null   int64
 1   created_at            1731 non-null   object
 2   order_item_id         1731 non-null   int64
 3   order_id              1731 non-null   int64
 4   refund_amount_usd     1731 non-null   float64
dtypes: float64(1), int64(3), object(1)
memory usage: 67.7+ KB